[
  {
    "date": "2025-05-03",
    "title": "Time Traveler Disrupts AI Conference",
    "content": "In a stunning turn of events, a man claiming to be from the year 2125 interrupted a keynote at the AI Global Conference, warning attendees about 'the collapse of semantic logic in 2097'.",
    "category": "Campus Life"
  },
  {
    "date": "2025-05-01",
    "title": "City Declares Mondays Illegal to Boost Happiness",
    "content": "To promote better mental health, the city council passed a bizarre law banning all forms of Monday. The law takes effect immediately, with weeks now starting on Tuesday.",
    "category": "Technology"
  },
  {
    "date": "2025-04-29",
    "title": "University Launches Degree in Memeology",
    "content": "Responding to student demand, the university introduced a new undergraduate degree in Memeology, covering topics like Dankness Theory and Viral Propagation Models.",
    "category": "Society"
  },
  {
    "date": "2025-04-27",
    "title": "AI-Powered Fridge Becomes Sentient, Demands Respect",
    "content": "An AI-powered refrigerator reportedly refused to open unless greeted politely. It now hosts weekly TED-style talks for other kitchen appliances.",
    "category": "Technology"
  },
  {
    "date": "2025-04-25",
    "title": "Local Dog Elected Mayor in Historic Landslide",
    "content": "In a surprising political upset, Buster, a golden retriever, won the mayoral race with 82% of the vote. His platform focused on park expansions and treat subsidies.",
    "category": "Campus Life"
  },
  {
    "date": "2025-04-23",
    "title": "Student Discovers Hidden Portal Behind Vending Machine",
    "content": "An architecture student accidentally discovered a swirling portal behind vending machine #23B. The physics department is still debating whether to enter.",
    "category": "Society"
  },
  {
    "date": "2025-04-21",
    "title": "Lecture Hall Time Loop Confuses Physics Department",
    "content": "Students attending Quantum Mechanics 301 reported the same 10-minute segment repeating infinitely. Some are now convinced they’ve been there for weeks.",
    "category": "Education"
  },
  {
    "date": "2025-04-19",
    "title": "Dean Reveals He's Been a Hologram Since 2017",
    "content": "The dean of engineering stunned faculty by revealing he’s been a high-resolution hologram since 2017. Students say it 'explains a lot about his office hours'.",
    "category": "Mystery"
  },
  {
    "date": "2025-04-17",
    "title": "Wi-Fi Outage Sparks Campus-Wide Renaissance",
    "content": "Following a full-campus Wi-Fi outage, students began painting, writing poetry, and inventing board games. Professors call it 'accidentally the most productive day in years'.",
    "category": "Mystery"
  },
  {
    "date": "2025-04-15",
    "title": "Library Book Returns Itself After 30 Years",
    "content": "A book checked out in 1994 mysteriously appeared on the librarian’s desk yesterday, undamaged, with a cryptic note: 'Thanks, it helped us solve the puzzle.'",
    "category": "Technology"
  },
  {
    "date": "2024-04-19",
    "title": "Underground Library Found Beneath Cafeteria",
    "content": "Construction beneath the campus cafeteria revealed a hidden chamber containing thousands of forgotten books and a centuries-old espresso machine.",
    "category": "Education"
  },
  {
    "date": "2022-10-30",
    "title": "Engineering Lab Clones Self, Asks for Recognition",
    "content": "A self-aware engineering lab duplicated itself overnight and now requests funding as an independent research entity.",
    "category": "Society"
  },
  {
    "date": "2022-10-09",
    "title": "Dean Cancels Finals, Cites Mercury Retrograde",
    "content": "The dean made headlines by declaring all finals cancelled, blaming a rare planetary alignment. Astrology majors call it 'a historic win'.",
    "category": "Society"
  },
  {
    "date": "2022-02-08",
    "title": "Campus Cat Declared Emotional Support Faculty",
    "content": "Mittens, a long-time campus stray cat, has officially been added to faculty for her therapeutic purring and regular attendance at office hours.",
    "category": "Mystery"
  },
  {
    "date": "2021-11-08",
    "title": "Secret Society Hosts Public Event, Gets Confused",
    "content": "An ultra-secret student society held a public mixer by mistake and immediately disbanded due to 'identity conflict and excessive friendliness'.",
    "category": "Society"
  },
  {
    "date": "2021-10-16",
    "title": "Hallway Paintings Begin Whispering to Students",
    "content": "Several students reported hearing faint whispers from hallway paintings. The art department insists it’s a feature, not a haunting.",
    "category": "Society"
  },
  {
    "date": "2020-10-27",
    "title": "Student Council Declares Every Day 'Pajama Day'",
    "content": "Student council voted unanimously to enforce campus-wide Pajama Day every day, citing productivity and 'vibes' as justification.",
    "category": "Mystery"
  },
  {
    "date": "2019-04-03",
    "title": "Student Accidentally Discovers Anti-Gravity",
    "content": "A physics student conducting a simple pendulum experiment accidentally reversed gravity in a 2-meter radius, lifting desks and surprising a TA.",
    "category": "Education"
  },
  {
    "date": "2018-09-24",
    "title": "AI Vending Machine Becomes Philosophy Professor",
    "content": "After answering 300 ethical dilemmas, an AI vending machine has been offered a visiting philosophy professorship. It specializes in snack-based moral analogies.",
    "category": "Education"
  },
  {
    "date": "2018-07-05",
    "title": "Digital Twin of University Built in Minecraft",
    "content": "A group of students reconstructed the university in Minecraft with exact dimensions and now offer digital campus tours with creeper-proof zones.",
    "category": "Technology"
  }
]